In [1]:
sc

In [2]:
spark

In [3]:
!hadoop fs -mkdir /sales

In [4]:
!hadoop fs -put /home/hadoop/Downloads/sales_data_sample(1).csv /sales/

/bin/bash: -c: line 0: syntax error near unexpected token `('
/bin/bash: -c: line 0: `hadoop fs -put /home/hadoop/Downloads/sales_data_sample(1).csv /sales/'

In [5]:
!hadoop fs -put /home/hadoop/Downloads/sales_data_sample.csv /sales/

put: `/home/hadoop/Downloads/sales_data_sample.csv': No such file or directory

In [6]:
!hadoop fs -put /home/hadoop/Downloads/sales_data_sample.csv /sales/

In [7]:
sales_df = spark.read.csv("hdfs://localhost:9000/sales/sales_data_sample.csv",header =True,inferSchema=True)

1.Read the files

In [8]:
sales_df.head(2)

[Row(ORDERNUMBER=10107, QUANTITYORDERED=30, PRICEEACH=95.7, ORDERLINENUMBER=2, SALES=2871.0, ORDERDATE='2/24/2003 0:00', STATUS='Shipped', QTR_ID=1, MONTH_ID=2, YEAR_ID=2003, PRODUCTLINE='Motorcycles', MSRP=95, PRODUCTCODE='S10_1678', CUSTOMERNAME='Land of Toys Inc.', PHONE='2125557818', ADDRESSLINE1='897 Long Airport Avenue', ADDRESSLINE2=None, CITY='NYC', STATE='NY', POSTALCODE='10022', COUNTRY='USA', TERRITORY='NA', CONTACTLASTNAME='Yu', CONTACTFIRSTNAME='Kwai', DEALSIZE='Small'),
 Row(ORDERNUMBER=10121, QUANTITYORDERED=34, PRICEEACH=81.35, ORDERLINENUMBER=5, SALES=2765.9, ORDERDATE='5/7/2003 0:00', STATUS='Shipped', QTR_ID=2, MONTH_ID=5, YEAR_ID=2003, PRODUCTLINE='Motorcycles', MSRP=95, PRODUCTCODE='S10_1678', CUSTOMERNAME='Reims Collectables', PHONE='26.47.1555', ADDRESSLINE1="59 rue de l'Abbaye", ADDRESSLINE2=None, CITY='Reims', STATE=None, POSTALCODE='51100', COUNTRY='France', TERRITORY='EMEA', CONTACTLASTNAME='Henriot', CONTACTFIRSTNAME='Paul', DEALSIZE='Small')]

In [9]:
sales_df.toPandas()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,None,NYC,NY,10022,USA,NA,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,None,Reims,None,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,None,Paris,None,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,None,Pasadena,CA,90003,USA,NA,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,None,San Francisco,CA,None,USA,NA,Brown,Julie,Medium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2818,10350,20,100.00,15,2244.40,12/2/2004 0:00,Shipped,4,12,2004,...,"C/ Moralzarzal, 86",None,Madrid,None,28034,Spain,EMEA,Freyre,Diego,Small
2819,10373,29,100.00,1,3978.51,1/31/2005 0:00,Shipped,1,1,2005,...,Torikatu 38,None,Oulu,None,90110,Finland,EMEA,Koskitalo,Pirkko,Medium
2820,10386,43,100.00,4,5417.57,3/1/2005 0:00,Resolved,1,3,2005,...,"C/ Moralzarzal, 86",None,Madrid,None,28034,Spain,EMEA,Freyre,Diego,Medium
2821,10397,34,62.24,1,2116.16,3/28/2005 0:00,Shipped,1,3,2005,...,1 rue Alsace-Lorraine,None,Toulouse,None,31000,France,EMEA,Roulet,Annette,Small
2822,10414,47,65.52,9,3079.44,5/6/2005 0:00,On Hold,2,5,2005,...,8616 Spinnaker Dr.,None,Boston,MA,51003,USA,NA,Yoshido,Juri,Medium

In [10]:
sales_df.rdd.getNumPartitions()

1

In [12]:
sales_df= sales_df.repartition(2)

In [13]:
sales_df.rdd.getNumPartitions()

2

In [14]:
#sales_df.write.parquet("hdfs://localhost:9000/sales/parquet")

In [15]:
sales_df= spark.read.parquet("hdfs://localhost:9000/sales/parquet")

In [16]:
#parquet file gives fastr responses to queries.
#it stores queries as columnar format

In [17]:
sales_df.show()

+-----------+---------------+---------+---------------+-------+---------------+---------+------+--------+-------+----------------+----+-----------+--------------------+-----------------+--------------------+------------+------------+--------+----------+---------+---------+---------------+----------------+--------+
|ORDERNUMBER|QUANTITYORDERED|PRICEEACH|ORDERLINENUMBER|  SALES|      ORDERDATE|   STATUS|QTR_ID|MONTH_ID|YEAR_ID|     PRODUCTLINE|MSRP|PRODUCTCODE|        CUSTOMERNAME|            PHONE|        ADDRESSLINE1|ADDRESSLINE2|        CITY|   STATE|POSTALCODE|  COUNTRY|TERRITORY|CONTACTLASTNAME|CONTACTFIRSTNAME|DEALSIZE|
+-----------+---------------+---------+---------------+-------+---------------+---------+------+--------+-------+----------------+----+-----------+--------------------+-----------------+--------------------+------------+------------+--------+----------+---------+---------+---------------+----------------+--------+
|      10248|             32|    75.89|              4|2428.48|  5/7/2004 0:00|Cancelled|     2|       5|   2004|           Ships|  72|  S700_2610|   Land of Toys Inc.|       2125557818|897 Long Airport ...|        null|         NYC|      NY|     10022|      USA|       NA|             Yu|            Kwai|   Small|
|      10363|             43|    100.0|              9|5154.41|  1/6/2005 0:00|  Shipped|     1|       1|   2005|    Classic Cars|  80|   S24_4620| Suominen Souveniers|  +358 9 8045 555|Software Engineer...|        null|       Espoo|    null| FIN-02271|  Finland|     EMEA|       Suominen|           Kalle|  Medium|
|      10127|             20|    96.99|              7| 1939.8|  6/3/2003 0:00|  Shipped|     2|       6|   2003|    Classic Cars| 118|   S24_4048|  Muscle Machine Inc|       2125557413|   4092 Furth Circle|   Suite 400|         NYC|      NY|     10022|      USA|       NA|          Young|            Jeff|   Small|
|      10276|             38|    83.79|              4|3184.02|  8/2/2004 0:00|  Shipped|     3|       8|   2004|    Classic Cars|  79|   S12_3990|Online Mini Colle...|       6175557555|  7635 Spinnaker Dr.|        null|  Brickhaven|      MA|     58339|      USA|       NA|        Barajas|          Miguel|  Medium|
|      10391|             42|    100.0|              3| 4998.0|  3/9/2005 0:00|  Shipped|     1|       3|   2005|    Vintage Cars|  53|   S18_1367|Anna's Decoration...|     02 9936 8555|   201 Miller Street|    Level 15|North Sydney|     NSW|      2060|Australia|     APAC|         O'Hara|            Anna|  Medium|
|      10288|             32|    100.0|              5| 5875.2|  9/1/2004 0:00|  Shipped|     3|       9|   2004|    Vintage Cars| 170|   S18_1749|    Handji Gifts& Co|     +65 224 1555|Village Close - 1...|   2nd Floor|   Singapore|    null|     69045|Singapore|     APAC|      Victorino|           Wendy|  Medium|
|      10245|             45|    59.87|              7|2694.15|  5/4/2004 0:00|  Shipped|     2|       5|   2004|    Vintage Cars|  50|   S18_4668|    Super Scale Inc.|       2035559545|567 North Pendale...|        null|   New Haven|      CT|     97823|      USA|       NA|         Murphy|          Leslie|   Small|
|      10119|             41|     59.6|              4| 2443.6| 4/28/2003 0:00|  Shipped|     2|       4|   2003|          Planes|  68|   S24_2841|Salzburg Collecta...|        6562-9555|         Geislweg 14|        null|    Salzburg|    null|      5020|  Austria|     EMEA|          Pipps|           Georg|   Small|
|      10244|             36|    84.33|              5|3035.88| 4/29/2004 0:00|  Shipped|     2|       4|   2004|    Vintage Cars|  99|   S18_3320|Euro Shopping Cha...|   (91) 555 94 44|  C/ Moralzarzal, 86|        null|      Madrid|    null|     28034|    Spain|     EMEA|         Freyre|           Diego|  Medium|
|      10140|             38|    100.0|              8| 4829.8| 7/24/2003 0:00|  Shipped|     3|       7|   2003|Trucks and Buses| 136|   S12_1666|Technics Stores Inc.|       6505556809|   9408 Furth Circle|        null|  Burlingame|      CA|     94217|      USA|       NA|         Hirano|            Juri|  Medium|
|      10305|             36|    100.0|              8|4816.08|10/13/2004 0:00|  Shipped|     4|      10|   2004|Trucks and Buses| 122|   S18_2319|Marta's Replicas Co.|       6175558555| 39323 Spinnaker Dr.|        null|   Cambridge|      MA|     51247|      USA|       NA|      Hernandez|           Marta|  Medium|
|      10169|             33|    100.0|              7| 4910.4| 11/4/2003 0:00|  Shipped|     4|      11|   2003|    Classic Cars| 148|   S18_4721|Anna's Decoration...|     02 9936 8555|   201 Miller Street|    Level 15|North Sydney|     NSW|      2060|Australia|     APAC|         O'Hara|            Anna|  Medium|
|      10407|             59|    100.0|             11|7048.14| 4/22/2005 0:00|  On Hold|     2|       4|   2005|    Classic Cars| 124|   S18_1589|The Sharp Gifts W...|       4085553659|      3086 Ingle Ln.|        null|    San Jose|      CA|     94217|      USA|       NA|          Frick|             Sue|   Large|
|      10248|             30|    100.0|              5| 3053.7|  5/7/2004 0:00|Cancelled|     2|       5|   2004|    Vintage Cars|  88|   S24_3151|   Land of Toys Inc.|       2125557818|897 Long Airport ...|        null|         NYC|      NY|     10022|      USA|       NA|             Yu|            Kwai|  Medium|
|      10230|             43|    100.0|              1|7016.31| 3/15/2004 0:00|  Shipped|     1|       3|   2004|    Classic Cars| 151|   S12_3148|Blauer See Auto, Co.|+49 69 66 90 2555|       Lyonerstr. 34|        null|   Frankfurt|    null|     60528|  Germany|     EMEA|         Keitel|          Roland|   Large|
|      10341|             45|    79.65|              2|3584.25|11/24/2004 0:00|  Shipped|     4|      11|   2004|    Classic Cars| 194|   S12_1099|Salzburg Collecta...|        6562-9555|         Geislweg 14|        null|    Salzburg|    null|      5020|  Austria|     EMEA|          Pipps|           Georg|  Medium|
|      10310|             49|    97.01|             14|4753.49|10/16/2004 0:00|  Shipped|     4|      10|   2004|    Classic Cars|  80|   S24_4620|Toms Spezialitten...|     0221-5554327|  Mehrheimerstr. 369|        null|        Koln|    null|     50739|  Germany|     EMEA|      Pfalzheim|       Henriette|  Medium|
|      10379|             39|    100.0|              2|5399.55| 2/10/2005 0:00|  Shipped|     1|       2|   2005|    Vintage Cars| 170|   S18_1749|Euro Shopping Cha...|   (91) 555 94 44|  C/ Moralzarzal, 86|        null|      Madrid|    null|     28034|    Spain|     EMEA|         Freyre|           Diego|  Medium|
|      10223|             28|    60.57|              5|1695.96| 2/20/2004 0:00|  Shipped|     1|       2|   2004|     Motorcycles|  60|   S18_2625|Australian Collec...|     03 9520 4555|   636 St Kilda Road|     Level 3|   Melbourne|Victoria|      3004|Australia|     APAC|       Ferguson|           Peter|   Small|
|      10103|             45|    75.63|              7|3403.35| 1/29/2003 0:00|  Shipped|     1|       1|   2003|Trucks and Buses|  64|   S32_3522|  Baane Mini Imports|       07-98 9555|Erling Skakkes ga...|        null|     Stavern|    null|      4110|   Norway|     EMEA|     Bergulfsen|           Jonas|  Medium|
+-----------+---------------+---------+---------------+-------+---------------+---------+------+--------+-------+----------------+----+-----------+--------------------+-----------------+--------------------+------------+------------+--------+----------+---------+---------+---------------+----------------+--------+
only showing top 20 rows

2. Materialized view of DataFrame

In [18]:
#put all the DataFrame in-memory
sales_df.cache()

DataFrame[ORDERNUMBER: int, QUANTITYORDERED: int, PRICEEACH: double, ORDERLINENUMBER: int, SALES: double, ORDERDATE: string, STATUS: string, QTR_ID: int, MONTH_ID: int, YEAR_ID: int, PRODUCTLINE: string, MSRP: int, PRODUCTCODE: string, CUSTOMERNAME: string, PHONE: string, ADDRESSLINE1: string, ADDRESSLINE2: string, CITY: string, STATE: string, POSTALCODE: string, COUNTRY: string, TERRITORY: string, CONTACTLASTNAME: string, CONTACTFIRSTNAME: string, DEALSIZE: string]

In [19]:
sales_df.createOrReplaceTempView("productSales")

In [25]:
spark.sql("""select * from productSales limit 5 """).toPandas()

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10248,32,75.89,4,2428.48,5/7/2004 0:00,Cancelled,2,5,2004,...,897 Long Airport Avenue,None,NYC,NY,10022,USA,NA,Yu,Kwai,Small
1,10363,43,100.00,9,5154.41,1/6/2005 0:00,Shipped,1,1,2005,...,"Software Engineering Center, SEC Oy",None,Espoo,None,FIN-02271,Finland,EMEA,Suominen,Kalle,Medium
2,10127,20,96.99,7,1939.80,6/3/2003 0:00,Shipped,2,6,2003,...,4092 Furth Circle,Suite 400,NYC,NY,10022,USA,NA,Young,Jeff,Small
3,10276,38,83.79,4,3184.02,8/2/2004 0:00,Shipped,3,8,2004,...,7635 Spinnaker Dr.,None,Brickhaven,MA,58339,USA,NA,Barajas,Miguel,Medium
4,10391,42,100.00,3,4998.00,3/9/2005 0:00,Shipped,1,3,2005,...,201 Miller Street,Level 15,North Sydney,NSW,2060,Australia,APAC,O'Hara,Anna,Medium

In [31]:
spark.sql("""select * from productSales limit 5 """).show()

+-----------+---------------+---------+---------------+-------+-------------+---------+------+--------+-------+------------+----+-----------+--------------------+---------------+--------------------+------------+------------+-----+----------+---------+---------+---------------+----------------+--------+
|ORDERNUMBER|QUANTITYORDERED|PRICEEACH|ORDERLINENUMBER|  SALES|    ORDERDATE|   STATUS|QTR_ID|MONTH_ID|YEAR_ID| PRODUCTLINE|MSRP|PRODUCTCODE|        CUSTOMERNAME|          PHONE|        ADDRESSLINE1|ADDRESSLINE2|        CITY|STATE|POSTALCODE|  COUNTRY|TERRITORY|CONTACTLASTNAME|CONTACTFIRSTNAME|DEALSIZE|
+-----------+---------------+---------+---------------+-------+-------------+---------+------+--------+-------+------------+----+-----------+--------------------+---------------+--------------------+------------+------------+-----+----------+---------+---------+---------------+----------------+--------+
|      10248|             32|    75.89|              4|2428.48|5/7/2004 0:00|Cancelled|     2|       5|   2004|       Ships|  72|  S700_2610|   Land of Toys Inc.|     2125557818|897 Long Airport ...|        null|         NYC|   NY|     10022|      USA|       NA|             Yu|            Kwai|   Small|
|      10363|             43|    100.0|              9|5154.41|1/6/2005 0:00|  Shipped|     1|       1|   2005|Classic Cars|  80|   S24_4620| Suominen Souveniers|+358 9 8045 555|Software Engineer...|        null|       Espoo| null| FIN-02271|  Finland|     EMEA|       Suominen|           Kalle|  Medium|
|      10127|             20|    96.99|              7| 1939.8|6/3/2003 0:00|  Shipped|     2|       6|   2003|Classic Cars| 118|   S24_4048|  Muscle Machine Inc|     2125557413|   4092 Furth Circle|   Suite 400|         NYC|   NY|     10022|      USA|       NA|          Young|            Jeff|   Small|
|      10276|             38|    83.79|              4|3184.02|8/2/2004 0:00|  Shipped|     3|       8|   2004|Classic Cars|  79|   S12_3990|Online Mini Colle...|     6175557555|  7635 Spinnaker Dr.|        null|  Brickhaven|   MA|     58339|      USA|       NA|        Barajas|          Miguel|  Medium|
|      10391|             42|    100.0|              3| 4998.0|3/9/2005 0:00|  Shipped|     1|       3|   2005|Vintage Cars|  53|   S18_1367|Anna's Decoration...|   02 9936 8555|   201 Miller Street|    Level 15|North Sydney|  NSW|      2060|Australia|     APAC|         O'Hara|            Anna|  Medium|
+-----------+---------------+---------+---------------+-------+-------------+---------+------+--------+-------+------------+----+-----------+--------------------+---------------+--------------------+------------+------------+-----+----------+---------+---------+---------------+----------------+--------+

In [29]:
spark.sql("""select ROUND (Sum(SALES),2) as TotalSales from productSales""").toPandas()

    TotalSales
0  10032628.85

In [34]:
spark.sql("""select count(distinct CUSTOMERNAME) AS TotalCustomers from productSales""").show()

+--------------+
|TotalCustomers|
+--------------+
|            92|
+--------------+

In [35]:
sales_df.printSchema()

root
 |-- ORDERNUMBER: integer (nullable = true)
 |-- QUANTITYORDERED: integer (nullable = true)
 |-- PRICEEACH: double (nullable = true)
 |-- ORDERLINENUMBER: integer (nullable = true)
 |-- SALES: double (nullable = true)
 |-- ORDERDATE: string (nullable = true)
 |-- STATUS: string (nullable = true)
 |-- QTR_ID: integer (nullable = true)
 |-- MONTH_ID: integer (nullable = true)
 |-- YEAR_ID: integer (nullable = true)
 |-- PRODUCTLINE: string (nullable = true)
 |-- MSRP: integer (nullable = true)
 |-- PRODUCTCODE: string (nullable = true)
 |-- CUSTOMERNAME: string (nullable = true)
 |-- PHONE: string (nullable = true)
 |-- ADDRESSLINE1: string (nullable = true)
 |-- ADDRESSLINE2: string (nullable = true)
 |-- CITY: string (nullable = true)
 |-- STATE: string (nullable = true)
 |-- POSTALCODE: string (nullable = true)
 |-- COUNTRY: string (nullable = true)
 |-- TERRITORY: string (nullable = true)
 |-- CONTACTLASTNAME: string (nullable = true)
 |-- CONTACTFIRSTNAME: string (nullable = true)
 |-- DEALSIZE: string (nullable = true)

In [36]:
spark.sql("""select ROUND(sum(sales - priceeach*quantityordered),2)as totalProfit from productSales""").show()

+-----------+
|totalProfit|
+-----------+
| 1741742.06|
+-----------+

In [37]:
spark.sql("""select count(distinct(productline)) as ProductCategory, count(distinct(productcode))as Products from productSales""").show()

+---------------+--------+
|ProductCategory|Products|
+---------------+--------+
|              7|     109|
+---------------+--------+

In [42]:
#query to show quantity sold for each category
spark.sql("""select productline ,sum(quantityordered) as totalquantitysold from productSales group by productline order by totalquantitysold DESC""" ).show()

+----------------+-----------------+
|     productline|totalquantitysold|
+----------------+-----------------+
|    Classic Cars|            33992|
|    Vintage Cars|            21069|
|     Motorcycles|            11663|
|Trucks and Buses|            10777|
|          Planes|            10727|
|           Ships|             8127|
|          Trains|             2712|
+----------------+-----------------+

In [68]:
spark.sql(""" select month_id, sum(sales) as monthlysales from productSales group by month_id order by monthlysales DESC""").show()

+--------+------------------+
|month_id|      monthlysales|
+--------+------------------+
|      11|        2118885.67|
|      10|1121215.2200000002|
|       5| 923972.5599999998|
|       2| 810441.8999999999|
|       1| 785874.4400000002|
|       3| 754501.3900000002|
|       4| 669390.9600000002|
|       8| 659310.5699999998|
|      12| 634679.1199999999|
|       9|         584724.27|
|       7|         514875.97|
|       6|         454756.78|
+--------+------------------+

november has highest sales and june has the lowest sales

In [ ]:
#daily sales growth

In [78]:
spark.sql(""" select day(to_timestamp(ORDERDATE, 'M/d/yyyy H:mm')) AS daysofmonth, ROUND(SUM(SALES),2) AS total_daily_sales  from productSales group by daysofmonth order by daysofmonth""").show(31)

+-----------+-----------------+
|daysofmonth|total_daily_sales|
+-----------+-----------------+
|          1|        475012.06|
|          2|         502227.9|
|          3|        475244.84|
|          4|        391305.67|
|          5|        449433.22|
|          6|        409023.09|
|          7|        184538.76|
|          8|        317080.53|
|          9|        319138.68|
|         10|        453413.85|
|         11|        337277.46|
|         12|        370691.61|
|         13|        184228.08|
|         14|        268317.37|
|         15|        393526.68|
|         16|        348618.12|
|         17|        485042.85|
|         18|        200328.21|
|         19|        268589.99|
|         20|        497982.67|
|         21|        371600.41|
|         22|        346720.05|
|         23|        249216.78|
|         24|        265219.96|
|         25|        187778.59|
|         26|        223025.92|
|         27|          99146.4|
|         28|        276277.36|
|         29|        313845.11|
|         30|        196181.24|
|         31|        172595.39|
+-----------+-----------------+

In [91]:
#weekly sales growth
spark.sql(""" select weekofyear(to_timestamp(ORDERDATE, 'M/d/yyyy H:mm')) AS weeklysales, ROUND(SUM(SALES),2) AS total_daily_sales  from productSales group by weeklysales order by total_daily_sales DESC""").show(52)

+-----------+-----------------+
|weeklysales|total_daily_sales|
+-----------+-----------------+
|         45|         720936.2|
|         47|        499793.18|
|         42|        442559.93|
|         48|        419013.48|
|         46|        417250.29|
|         49|        408625.67|
|         43|        352143.05|
|         19|         328211.6|
|          8|        315804.08|
|          5|        292572.34|
|          3|        279981.77|
|         30|        270473.99|
|         18|        256736.54|
|          9|        245043.44|
|          7|        244371.43|
|         37|        240758.84|
|         34|        231144.58|
|         50|         219826.4|
|         32|        198913.64|
|         13|        192057.17|
|         22|         182501.2|
|         16|        178951.15|
|         27|        178170.16|
|         36|        169139.47|
|         41|        166008.16|
|         14|        165176.29|
|         12|        162716.58|
|         10|         145982.7|
|         23|        141735.38|
|         11|        140779.68|
|         25|         140038.4|
|         21|        139366.35|
|         38|        135686.82|
|          1|        132778.67|
|         40|        125530.74|
|         15|        119538.38|
|          2|        115220.48|
|          6|         112164.5|
|         20|        107947.34|
|         35|        106778.44|
|         28|         94820.15|
|         44|         83025.38|
|         26|         72178.39|
|         51|         68119.57|
|         39|         58368.11|
|          4|         46668.61|
|         17|         39610.95|
|         24|         37125.74|
|         29|         35090.54|
|         31|         31569.43|
|         33|         23623.47|
+-----------+-----------------+

In [92]:
#top 20 locations with most quantity ordered
spark.sql("""select city , sum(quantityordered) as totalquantity from productSales group by city order by totalquantity DESC limit(20)""").show()

+-------------+-------------+
|         city|totalquantity|
+-------------+-------------+
|       Madrid|        10958|
|   San Rafael|         6366|
|          NYC|         5294|
|    Singapore|         2760|
|        Paris|         2521|
|San Francisco|         2139|
|       Nantes|         2102|
|  New Bedford|         2043|
|    Melbourne|         1926|
|   Manchester|         1778|
|     San Jose|         1656|
|   Brickhaven|         1654|
|      Bergamo|         1650|
|       Boston|         1628|
|    Chatswood|         1601|
| North Sydney|         1469|
|     Salzburg|         1442|
|        Reims|         1433|
|         Lyon|         1428|
| Philadelphia|         1398|
+-------------+-------------+

In [149]:
#seasonal sales trends
result = spark.sql("""select MONTH_ID,
CASE
    WHEN QTR_ID == 1 THEN 'WINTER'
    WHEN QTR_ID == 2 THEN 'SPRING'
    WHEN QTR_ID == 3 THEN 'SUMMER'
    WHEN QTR_ID == 4 THEN 'FALL'
    
END
AS Seasons,sum(sales) as totalsales from productSales group by MONTH_ID,SeasonS order by MONTH_ID ASC""").show()

+--------+-------+------------------+
|MONTH_ID|Seasons|        totalsales|
+--------+-------+------------------+
|       1| WINTER| 785874.4400000002|
|       2| WINTER| 810441.8999999999|
|       3| WINTER| 754501.3900000002|
|       4| SPRING| 669390.9600000002|
|       5| SPRING| 923972.5599999998|
|       6| SPRING|         454756.78|
|       7| SUMMER|         514875.97|
|       8| SUMMER| 659310.5699999998|
|       9| SUMMER|         584724.27|
|      10|   FALL|1121215.2200000002|
|      11|   FALL|        2118885.67|
|      12|   FALL| 634679.1199999999|
+--------+-------+------------------+

In [155]:
result

MOVING 3 MONTH AVERAGE SALES FOR EACH PRODUCT

In [106]:
spark.sql("""
select YEAR_ID, MONTH_ID, PRODUCTCODE, SALES, AVG(SALES)
OVER(PARTITION BY PRODUCTCODE ORDER BY YEAR_ID, MONTH_ID
ROWS BETWEEN 3 PRECEDING AND CURRENT ROW) AS MOVING_3_MONTHS
FROM productsales ORDER BY PRODUCTCODE, YEAR_ID, MONTH_ID
""").show()

+-------+--------+-----------+-------+------------------+
|YEAR_ID|MONTH_ID|PRODUCTCODE|  SALES|   MOVING_3_MONTHS|
+-------+--------+-----------+-------+------------------+
|   2003|       2|   S10_1678| 2871.0|            2871.0|
|   2003|       5|   S10_1678| 2765.9|           2818.45|
|   2003|       7|   S10_1678|3884.34|3173.7466666666664|
|   2003|       8|   S10_1678| 3746.7|3316.9849999999997|
|   2003|      10|   S10_1678|5205.27|         4079.0175|
|   2003|      10|   S10_1678|3479.76|3469.1749999999997|
|   2003|      11|   S10_1678|5512.32|         4486.0125|
|   2003|      11|   S10_1678|2497.77|           4173.78|
|   2003|      12|   S10_1678|2168.54|3845.9750000000004|
|   2004|       1|   S10_1678|4708.44|         3721.7675|
|   2004|       2|   S10_1678|3965.66|         3335.1025|
|   2004|       4|   S10_1678|2333.12|3293.9399999999996|
|   2004|       5|   S10_1678|3188.64|3548.9649999999992|
|   2004|       6|   S10_1678|3676.76|          3291.045|
|   2004|       7|   S10_1678|4177.35|         3343.9675|
|   2004|       8|   S10_1678|4099.68|         3785.6075|
|   2004|       9|   S10_1678|2597.39|          3637.795|
|   2004|      10|   S10_1678|4394.38|            3817.2|
|   2004|      11|   S10_1678|7737.93|         5221.6225|
|   2004|      11|   S10_1678|4358.04|         3936.4875|
+-------+--------+-----------+-------+------------------+
only showing top 20 rows

In [108]:
#6. RANK the product Based on Sales in Each Quatar
spark.sql(""" select QTR_ID,PRODUCTCODE,SALES,DENSE_RANK() 
OVER(PARTITION BY QTR_ID ORDER BY SALES DESC) AS SALES_RANK 
FROM productSales ORDER BY QTR_ID,SALES_RANK""").show()

+------+-----------+-------+----------+
|QTR_ID|PRODUCTCODE|  SALES|SALES_RANK|
+------+-----------+-------+----------+
|     1|  S700_1691|10066.6|         1|
|     1|   S24_4278|10039.6|         2|
|     1|   S10_4698|9774.03|         3|
|     1|   S18_2795| 9534.5|         4|
|     1|   S18_1342|9240.44|         5|
|     1|   S50_1514|8977.05|         6|
|     1|   S18_3320| 8935.5|         7|
|     1|   S18_2248| 8884.8|         8|
|     1|   S12_1108|8690.36|         9|
|     1|   S12_1108|8602.92|        10|
|     1|   S12_1666|8470.14|        11|
|     1|   S18_2238|8448.64|        12|
|     1|   S12_1108|8378.58|        13|
|     1|   S24_1937|8344.71|        14|
|     1|   S18_4027| 8258.0|        15|
|     1|   S18_3232| 8257.0|        16|
|     1|   S10_1949| 8254.8|        17|
|     1|   S18_4668| 7827.3|        18|
|     1|   S12_1099| 7498.9|        19|
|     1|   S18_3482| 7397.0|        20|
+------+-----------+-------+----------+
only showing top 20 rows

In [133]:
#compare month-on-month sales

In [132]:
spark.sql("""
select MONTH_ID,
SUM(SALES) as TOTALSALES, 
SUM(SALES)-LAG(SUM(SALES))
OVER(ORDER BY MONTH_ID) AS MONTH_ON_MONTH from productSales GROUP BY MONTH_ID
""").show()

+--------+------------------+------------------+
|MONTH_ID|        TOTALSALES|    MONTH_ON_MONTH|
+--------+------------------+------------------+
|       1| 785874.4400000002|              null|
|       2| 810441.8999999999| 24567.45999999973|
|       3| 754501.3900000002|-55940.50999999966|
|       4| 669390.9600000002|-85110.43000000005|
|       5| 923972.5599999998|254581.59999999963|
|       6|         454756.78|-469215.7799999998|
|       7|         514875.97|60119.189999999944|
|       8| 659310.5699999998|144434.59999999986|
|       9|         584724.27|-74586.29999999981|
|      10|1121215.2200000002| 536490.9500000002|
|      11|        2118885.67| 997670.4499999997|
|      12| 634679.1199999999|       -1484206.55|
+--------+------------------+------------------+

In [ ]:
#CATEGORIZE THE PRODUCTCODE AS 'HOTSELLING' AND 'COLDSELLING' BASED ON THE ORDER QUANTITY IN EACH QUARTER
spark.sql("""
select QTR_ID,PRODUCTCODE,SUM(QUANTITYORDERED) AS totalquantity
""")

In [ ]:

#rank cities with hightest contribution and show top 20
#find the top customer sales contribution and find top 10 (total sales/sales purchased by each customer)

In [135]:
sales_df.printSchema()

root
 |-- ORDERNUMBER: integer (nullable = true)
 |-- QUANTITYORDERED: integer (nullable = true)
 |-- PRICEEACH: double (nullable = true)
 |-- ORDERLINENUMBER: integer (nullable = true)
 |-- SALES: double (nullable = true)
 |-- ORDERDATE: string (nullable = true)
 |-- STATUS: string (nullable = true)
 |-- QTR_ID: integer (nullable = true)
 |-- MONTH_ID: integer (nullable = true)
 |-- YEAR_ID: integer (nullable = true)
 |-- PRODUCTLINE: string (nullable = true)
 |-- MSRP: integer (nullable = true)
 |-- PRODUCTCODE: string (nullable = true)
 |-- CUSTOMERNAME: string (nullable = true)
 |-- PHONE: string (nullable = true)
 |-- ADDRESSLINE1: string (nullable = true)
 |-- ADDRESSLINE2: string (nullable = true)
 |-- CITY: string (nullable = true)
 |-- STATE: string (nullable = true)
 |-- POSTALCODE: string (nullable = true)
 |-- COUNTRY: string (nullable = true)
 |-- TERRITORY: string (nullable = true)
 |-- CONTACTLASTNAME: string (nullable = true)
 |-- CONTACTFIRSTNAME: string (nullable = true)
 |-- DEALSIZE: string (nullable = true)

In [138]:
#find top 20 city where highest contributionn is done to sales

spark.sql("""
select city,sum(sales) as totalsales 
from productSales group by city order by totalsales DESC limit(20)
""").show()

+-------------+------------------+
|         city|        totalsales|
+-------------+------------------+
|       Madrid|1082551.4399999995|
|   San Rafael| 654858.0599999999|
|          NYC| 560787.7700000001|
|    Singapore|288488.41000000003|
|        Paris|         268944.68|
|San Francisco|224358.67999999996|
|  New Bedford|207874.86000000002|
|       Nantes|204304.86000000004|
|    Melbourne|200995.40999999997|
|   Brickhaven|165255.19999999998|
|     San Jose|         160010.27|
|   Manchester|         157807.81|
|       Boston|         154069.66|
| North Sydney|153996.12999999998|
|    Chatswood|151570.97999999998|
| Philadelphia|         151189.13|
|     Salzburg|         149798.63|
|    Kobenhavn|          145041.6|
|         Lyon|         142874.25|
|Reggio Emilia|142601.33000000002|
+-------------+------------------+

In [160]:
#rank cities with hightest contribution and show top 20

spark.sql(""" select CITY,PRODUCTLINE,SALES,PERCENT_RANK() 
OVER(PARTITION BY CITY ORDER BY SALES DESC) AS SALES_RANK 
FROM productSales ORDER BY CITY,SALES_RANK DESC""").show()

+-------+----------------+-------+-------------------+
|   CITY|     PRODUCTLINE|  SALES|         SALES_RANK|
+-------+----------------+-------+-------------------+
|Aaarhus|    Classic Cars|1226.59|                1.0|
|Aaarhus|    Classic Cars|1448.07| 0.9615384615384616|
|Aaarhus|    Classic Cars| 1541.0| 0.9230769230769231|
|Aaarhus|           Ships|1753.06| 0.8846153846153846|
|Aaarhus|    Classic Cars| 2013.5| 0.8461538461538461|
|Aaarhus|    Classic Cars| 2144.6| 0.8076923076923077|
|Aaarhus|          Trains|2327.15| 0.7692307692307693|
|Aaarhus|          Trains|2337.38| 0.7307692307692307|
|Aaarhus|    Classic Cars|2339.92| 0.6923076923076923|
|Aaarhus|          Trains| 2481.7| 0.6538461538461539|
|Aaarhus|    Classic Cars|2692.12| 0.6153846153846154|
|Aaarhus|    Vintage Cars| 2731.8| 0.5769230769230769|
|Aaarhus|    Classic Cars|2759.75| 0.5384615384615384|
|Aaarhus|    Classic Cars| 3148.2|                0.5|
|Aaarhus|    Classic Cars| 3187.8|0.46153846153846156|
|Aaarhus|Trucks and Buses|3403.12| 0.4230769230769231|
|Aaarhus|    Classic Cars|3764.88|0.38461538461538464|
|Aaarhus|    Classic Cars|4000.26|0.34615384615384615|
|Aaarhus|    Classic Cars|4206.74| 0.3076923076923077|
|Aaarhus|    Classic Cars| 5544.0| 0.2692307692307692|
+-------+----------------+-------+-------------------+
only showing top 20 rows

In [159]:
#find the top customer sales contribution and find top 10 (total sales/sales purchased by each customer

spark.sql("""
select CUSTOMERNAME,SUM(SALES) AS total_sales,PERCENT_RANK() OVER (ORDER BY SUM(SALES) DESC) AS SALES_RANK
FROM productSales GROUP BY CUSTOMERNAME ORDER BY SALES_RANK DESC LIMIT 10
""").show()

+--------------------+------------------+------------------+
|        CUSTOMERNAME|       total_sales|        SALES_RANK|
+--------------------+------------------+------------------+
|   Boards & Toys Co.| 9129.349999999999|               1.0|
|   Atelier graphique|          24179.96| 0.989010989010989|
|Auto-Moto Classic...|26479.260000000002| 0.978021978021978|
|     Microscale Inc.| 33144.92999999999| 0.967032967032967|
|        Royale Belge|33440.100000000006|0.9560439560439561|
|Bavarian Collecta...|          34993.92| 0.945054945054945|
|Double Decker Gif...|          36019.04|0.9340659340659341|
|Cambridge Collect...|          36163.62|0.9230769230769231|
|West Coast Collec...|          46084.64|0.9120879120879121|
|Men 'R' US Retail...|          48048.46|0.9010989010989011|
+--------------------+------------------+------------------+